Ran Plan for 6 projects:

1. dir: `infra/us-east-1/mgmt/atlantis/ecr` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/key-pair` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/acm` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/ec2` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/alb` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/security-group` workspace: `default`

### 1. dir: `infra/us-east-1/mgmt/atlantis/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-18T10:47:31Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ecr.git. Relative paths in downloaded Terraform code may not work.
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=3792795651]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.this[0] will be created
+   resource "aws_ecr_lifecycle_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "keep last 20 images"
+                       rulePriority = 10
+                       selection    = {
+                           countNumber = 20
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire untagged images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

  # aws_ecr_repository.this[0] will be created
+   resource "aws_ecr_repository" "this" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "scde"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = {
+           "Environment"  = "mgmt"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }

+       encryption_configuration {
+           encryption_type = "AES256"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this[0] will be created
+   resource "aws_ecr_repository_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "ecr:ListTagsForResource",
+                           "ecr:ListImages",
+                           "ecr:GetRepositoryPolicy",
+                           "ecr:GetLifecyclePolicyPreview",
+                           "ecr:GetLifecyclePolicy",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:GetAuthorizationToken",
+                           "ecr:DescribeRepositories",
+                           "ecr:DescribeImages",
+                           "ecr:DescribeImageScanFindings",
+                           "ecr:BatchGetImage",
+                           "ecr:BatchCheckLayerAvailability",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::677160962006:root"
                        }
+                       Sid       = "PrivateReadOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   repository_arn         = (known after apply)
+   repository_registry_id = (known after apply)
+   repository_url         = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/ecr`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/ecr`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. dir: `infra/us-east-1/mgmt/atlantis/key-pair` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/key-pair`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fkey-pair%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/key-pair`

---
### 3. dir: `infra/us-east-1/mgmt/atlantis/acm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_acm_certificate.this[0] has changed
!   resource "aws_acm_certificate" "this" {
        id                        = "arn:aws:acm:us-east-1:677160962006:certificate/b360289d-9c8d-441c-877b-d56f20fbc339"
!       status                    = "PENDING_VALIDATION" -> "ISSUED"
        tags                      = {
            "Environment" = "mgmt"
            "Name"        = "atlantis-acm"
            "Project"     = "scde"
            "Tribe"       = "smartcontracts"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Changes to Outputs:
!   acm_certificate_status                    = "PENDING_VALIDATION" -> "ISSUED"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/acm`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Facm%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/acm`
</details>

**Note: Objects have changed outside of Terraform**

---
### 4. dir: `infra/us-east-1/mgmt/atlantis/ec2` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/ec2`

---
### 5. dir: `infra/us-east-1/mgmt/atlantis/alb` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_listener.this["http-https-redirect"] will be created
+   resource "aws_lb_listener" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d"
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags              = {
+           "terraform-aws-modules" = "alb"
        }
+       tags_all          = {
+           "Environment"           = "mgmt"
+           "Organization"          = "iog"
+           "Project"               = "scde"
+           "Terraform"             = "true"
+           "Tribe"                 = "smartcontracts"
+           "terraform-aws-modules" = "alb"
        }

+       default_action {
+           order = (known after apply)
+           type  = "redirect"

+           redirect {
+               host        = "#{host}"
+               path        = "/#{path}"
+               port        = "443"
+               protocol    = "HTTPS"
+               query       = "#{query}"
+               status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.this["https"] will be created
+   resource "aws_lb_listener" "this" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:us-east-1:677160962006:certificate/b360289d-9c8d-441c-877b-d56f20fbc339"
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d"
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-Res-2021-06"
+       tags              = {
+           "terraform-aws-modules" = "alb"
        }
+       tags_all          = {
+           "Environment"           = "mgmt"
+           "Organization"          = "iog"
+           "Project"               = "scde"
+           "Terraform"             = "true"
+           "Tribe"                 = "smartcontracts"
+           "terraform-aws-modules" = "alb"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.this["atlantis-ec2"] will be created
+   resource "aws_lb_target_group" "this" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_anomaly_mitigation  = (known after apply)
+       load_balancing_cross_zone_enabled  = "true"
+       name                               = "atlantis-ec2"
+       name_prefix                        = (known after apply)
+       port                               = 4141
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags                               = {
+           "terraform-aws-modules" = "alb"
        }
+       tags_all                           = {
+           "Environment"           = "mgmt"
+           "Organization"          = "iog"
+           "Project"               = "scde"
+           "Terraform"             = "true"
+           "Tribe"                 = "smartcontracts"
+           "terraform-aws-modules" = "alb"
        }
+       target_type                        = "instance"
+       vpc_id                             = "vpc-05d9f25d63d8ffb04"

+       health_check {
+           enabled             = true
+           healthy_threshold   = 5
+           interval            = 30
+           matcher             = "200"
+           path                = "/healthz"
+           port                = "4141"
+           protocol            = "HTTP"
+           timeout             = 5
+           unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group_attachment.this["atlantis-ec2"] will be created
+   resource "aws_lb_target_group_attachment" "this" {
+       id               = (known after apply)
+       port             = 4141
+       target_group_arn = (known after apply)
+       target_id        = "i-0899e81b556a77bd0"
    }

  # aws_route53_record.this["A"] will be created
+   resource "aws_route53_record" "this" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "atlantis-ec2"
+       type            = "A"
+       zone_id         = "Z10147571DRRDCJXSER5Y"

+       alias {
+           evaluate_target_health = true
+           name                   = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com"
+           zone_id                = "Z35SXDOTRQ7X7K"
        }
    }

  # aws_route53_record.this["AAA"] will be created
+   resource "aws_route53_record" "this" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "atlantis-ec2"
+       type            = "AAAA"
+       zone_id         = "Z10147571DRRDCJXSER5Y"

+       alias {
+           evaluate_target_health = true
+           name                   = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com"
+           zone_id                = "Z35SXDOTRQ7X7K"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!   listeners          = {
+       http-https-redirect = {
+           alpn_policy           = null
+           arn                   = (known after apply)
+           certificate_arn       = null
+           default_action        = [
+               {
+                   authenticate_cognito = []
+                   authenticate_oidc    = []
+                   fixed_response       = []
+                   forward              = []
+                   order                = (known after apply)
+                   redirect             = [
+                       {
+                           host        = "#{host}"
+                           path        = "/#{path}"
+                           port        = "443"
+                           protocol    = "HTTPS"
+                           query       = "#{query}"
+                           status_code = "HTTP_301"
                        },
                    ]
+                   target_group_arn     = null
+                   type                 = "redirect"
                },
            ]
+           id                    = (known after apply)
+           load_balancer_arn     = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d"
+           mutual_authentication = (known after apply)
+           port                  = 80
+           protocol              = "HTTP"
+           ssl_policy            = (known after apply)
+           tags                  = {
+               terraform-aws-modules = "alb"
            }
+           tags_all              = {
+               Environment           = "mgmt"
+               Organization          = "iog"
+               Project               = "scde"
+               Terraform             = "true"
+               Tribe                 = "smartcontracts"
+               terraform-aws-modules = "alb"
            }
+           timeouts              = null
        }
+       https               = {
+           alpn_policy           = null
+           arn                   = (known after apply)
+           certificate_arn       = "arn:aws:acm:us-east-1:677160962006:certificate/b360289d-9c8d-441c-877b-d56f20fbc339"
+           default_action        = [
+               {
+                   authenticate_cognito = []
+                   authenticate_oidc    = []
+                   fixed_response       = []
+                   forward              = []
+                   order                = (known after apply)
+                   redirect             = []
+                   target_group_arn     = (known after apply)
+                   type                 = "forward"
                },
            ]
+           id                    = (known after apply)
+           load_balancer_arn     = "arn:aws:elasticloadbalancing:us-east-1:677160962006:loadbalancer/app/atlantis-mgmt-smartcontracts-alb/648e5a511365f99d"
+           mutual_authentication = (known after apply)
+           port                  = 443
+           protocol              = "HTTPS"
+           ssl_policy            = "ELBSecurityPolicy-TLS13-1-2-Res-2021-06"
+           tags                  = {
+               terraform-aws-modules = "alb"
            }
+           tags_all              = {
+               Environment           = "mgmt"
+               Organization          = "iog"
+               Project               = "scde"
+               Terraform             = "true"
+               Tribe                 = "smartcontracts"
+               terraform-aws-modules = "alb"
            }
+           timeouts              = null
        }
    }
!   route53_records    = {
+       A   = {
+           alias                            = [
+               {
+                   evaluate_target_health = true
+                   name                   = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com"
+                   zone_id                = "Z35SXDOTRQ7X7K"
                },
            ]
+           allow_overwrite                  = (known after apply)
+           cidr_routing_policy              = []
+           failover_routing_policy          = []
+           fqdn                             = (known after apply)
+           geolocation_routing_policy       = []
+           health_check_id                  = null
+           id                               = (known after apply)
+           latency_routing_policy           = []
+           multivalue_answer_routing_policy = null
+           name                             = "atlantis-ec2"
+           records                          = null
+           set_identifier                   = null
+           ttl                              = null
+           type                             = "A"
+           weighted_routing_policy          = []
+           zone_id                          = "Z10147571DRRDCJXSER5Y"
        }
+       AAA = {
+           alias                            = [
+               {
+                   evaluate_target_health = true
+                   name                   = "atlantis-mgmt-smartcontracts-alb-329464703.us-east-1.elb.amazonaws.com"
+                   zone_id                = "Z35SXDOTRQ7X7K"
                },
            ]
+           allow_overwrite                  = (known after apply)
+           cidr_routing_policy              = []
+           failover_routing_policy          = []
+           fqdn                             = (known after apply)
+           geolocation_routing_policy       = []
+           health_check_id                  = null
+           id                               = (known after apply)
+           latency_routing_policy           = []
+           multivalue_answer_routing_policy = null
+           name                             = "atlantis-ec2"
+           records                          = null
+           set_identifier                   = null
+           ttl                              = null
+           type                             = "AAAA"
+           weighted_routing_policy          = []
+           zone_id                          = "Z10147571DRRDCJXSER5Y"
        }
    }
!   target_groups      = {
+       atlantis-ec2 = {
+           arn                                = (known after apply)
+           arn_suffix                         = (known after apply)
+           connection_termination             = (known after apply)
+           deregistration_delay               = "300"
+           health_check                       = [
+               {
+                   enabled             = true
+                   healthy_threshold   = 5
+                   interval            = 30
+                   matcher             = "200"
+                   path                = "/healthz"
+                   port                = "4141"
+                   protocol            = "HTTP"
+                   timeout             = 5
+                   unhealthy_threshold = 2
                },
            ]
+           id                                 = (known after apply)
+           ip_address_type                    = (known after apply)
+           lambda_multi_value_headers_enabled = false
+           load_balancing_algorithm_type      = (known after apply)
+           load_balancing_anomaly_mitigation  = (known after apply)
+           load_balancing_cross_zone_enabled  = "true"
+           name                               = "atlantis-ec2"
+           name_prefix                        = (known after apply)
+           port                               = 4141
+           preserve_client_ip                 = (known after apply)
+           protocol                           = "HTTP"
+           protocol_version                   = (known after apply)
+           proxy_protocol_v2                  = false
+           slow_start                         = 0
+           stickiness                         = (known after apply)
+           tags                               = {
+               terraform-aws-modules = "alb"
            }
+           tags_all                           = {
+               Environment           = "mgmt"
+               Organization          = "iog"
+               Project               = "scde"
+               Terraform             = "true"
+               Tribe                 = "smartcontracts"
+               terraform-aws-modules = "alb"
            }
+           target_failover                    = (known after apply)
+           target_health_state                = (known after apply)
+           target_type                        = "instance"
+           vpc_id                             = "vpc-05d9f25d63d8ffb04"
        }
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/alb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Falb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/alb`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
### 6. dir: `infra/us-east-1/mgmt/atlantis/security-group` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/security-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fsecurity-group%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/security-group`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`